app/views/students/exam.html.erb

SELECT "grades".* FROM "grades" WHERE "grades"."SubjectID" IN (2, 3, 4, 5, 6, 7, 8, 1)
---
                  <h3><%= subject.Name %></h3>
                  <% if subject.grades.any? %>