app/controllers/application_controller.rb

SELECT "students".* FROM "students" WHERE "students"."StudentID" = 1 LIMIT 1
---
  def current_student
    @current_student ||= Student.find(session[:student_id]) if session[:student_id]