app/controllers/sessions_controller.rb

SELECT "students".* FROM "students" WHERE "students"."email" = 'janot@test.com' LIMIT 1
---
  def create
    student = Student.find_by(email: params[:email])