app/controllers/students_controller.rb

  def dashboard
    @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."StudentID" = 1 LIMIT 1

  def profile
    @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."StudentID" = 1 LIMIT 1

  def exam
    @student = Student.find(params[:id])
    @subjects = Subject.where(StudentID: @student.id).includes(:grades) # Fetch subjects and their grades for specific student
---
SELECT "students".* FROM "students" WHERE "students"."StudentID" = 1 LIMIT 1
SELECT "grades".* FROM "grades" WHERE "grades"."SubjectID" IN (2, 3, 4, 5, 6, 7, 8, 1)
SELECT "subjects".* FROM "subjects" WHERE "subjects"."StudentID" = 1

def download_exam_report
  @student = Student.find(params[:id])
  @subjects = Subject.where(StudentID: @student.id).includes(:grades)

  respond_to do |format|
    format.html
    format.pdf do
      pdf = Prawn::Document.new(page_size: "A4", margin: [ 30, 30, 30, 30 ]) do |pdf|
        # Header with orange background
        pdf.fill_color "E57E0C"
        pdf.rectangle [ 0, pdf.cursor ], pdf.bounds.width, 80
        pdf.fill

        pdf.move_down 20

        # Student information in white
        pdf.fill_color "FFFFFF"
        pdf.text_box "NAME: #{@student.StudentName}", at: [ 30, pdf.cursor ]
        pdf.move_down 20
        pdf.text_box "CLASS: #{@student.StudentClass}", at: [ 30, pdf.cursor ]
        pdf.move_down 20
        pdf.text_box "STUDENT ID: #{@student.StudentID}", at: [ 30, pdf.cursor ]
---
SELECT "students".* FROM "students" WHERE "students"."StudentID" = 1 LIMIT 1
SELECT "grades".* FROM "grades" WHERE "grades"."SubjectID" IN (2, 3, 4, 5, 6, 7, 8, 1)
SELECT "subjects".* FROM "subjects" WHERE "subjects"."StudentID" = 1

        table_data << [ "Subject", "Grade" ]  # Header row

        @subjects.each do |subject|
          grades = subject.grades.map(&:Grade).join(", ")
---
SELECT "grades".* FROM "grades" WHERE "grades"."SubjectID" IN (2, 3, 4, 5, 6, 7, 8, 1)